In [3]:
import pandas as pd
# this "firm" variable is really "last firm" but the database manager called it what they called it 
# and now IT is scared that fixing it will break all their systems, so it's "stuck as-is"
some_employees = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'firm': ['Citi','GS','Accenture','Wells Fargo'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR'],
                    'hire_date': [2004, 2008, 2012, 2014]})

departments = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'employees': [100,200,1] })

current_employer = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'firm': ['Yahoo','Yahoo','Yahoo','Yahoo']})

some_employees_alt = pd.DataFrame({'employee': ['Jonathan', 'Mary', 'Lisa', 'Sue'],
                    'firm': ['?','Lehigh','Accenture','Wells Fargo'],
                    'group': ['Accounting', 'CEO', 'Engineering', 'HR'],
                    'hire_date': [2010, 2019, 2012, 2014]})

In [21]:
some_employees_alt.merge(departments, how = 'inner')

   employee         firm        group  hire_date  employees
0  Jonathan            ?   Accounting       2010        100
1      Lisa    Accenture  Engineering       2012        200
2       Sue  Wells Fargo           HR       2014          1

In [18]:
some_employees.merge(departments, how = 'outer')

  employee         firm        group  hire_date  employees
0      Bob         Citi   Accounting       2004        100
1     Jake           GS  Engineering       2008        200
2     Lisa    Accenture  Engineering       2012        200
3      Sue  Wells Fargo           HR       2014          1

In [22]:
some_employees.merge(current_employer, how = 'right')

  employee   firm group  hire_date
0      Bob  Yahoo   NaN        NaN
1     Jake  Yahoo   NaN        NaN
2     Lisa  Yahoo   NaN        NaN
3      Sue  Yahoo   NaN        NaN

In [20]:
some_employees.merge(departments, how = 'left')

  employee         firm        group  hire_date  employees
0      Bob         Citi   Accounting       2004        100
1     Jake           GS  Engineering       2008        200
2     Lisa    Accenture  Engineering       2012        200
3      Sue  Wells Fargo           HR       2014          1

In [5]:
import numpy as np

df = pd.DataFrame({"A":[12, 4, 5, None, 1], 
                   "B":[None, 2, 54, 3, None], 
                   "C":[20, 16, None, 3, 8], 
                   "D":[14, 3, None, None, 6]})

In [6]:
df

      A     B     C     D
0  12.0   NaN  20.0  14.0
1   4.0   2.0  16.0   3.0
2   5.0  54.0   NaN   NaN
3   NaN   3.0   3.0   NaN
4   1.0   NaN   8.0   6.0

fillna - any value (strings included) you want, back fill, forward, fill, and more

In [8]:
df.fillna(value = 0)

      A     B     C     D
0  12.0   0.0  20.0  14.0
1   4.0   2.0  16.0   3.0
2   5.0  54.0   0.0   0.0
3   0.0   3.0   3.0   0.0
4   1.0   0.0   8.0   6.0

In [9]:
df.dropna()

     A    B     C    D
1  4.0  2.0  16.0  3.0

dropna - might not be explicitly needed, some functions ignore NaNs, but some don't. I tend to drop only as needed for a given estimation, and only temporarily.

In [10]:
df['A'].dropna()

0    12.0
1     4.0
2     5.0
4     1.0
Name: A, dtype: float64

replace - some datasets use a certain number to indicate missing data (i.e. -99). Convert these to NaN with this function.

In [11]:
df.replace()

      A     B     C     D
0  12.0   NaN  20.0  14.0
1   4.0   2.0  16.0   3.0
2   5.0  54.0  16.0   3.0
3   5.0   3.0   3.0   3.0
4   1.0   3.0   8.0   6.0

interpolate - e.g. use values in surrounding time periods to fill in gaps
Deduce.

In [13]:
df.interpolate()

      A     B     C     D
0  12.0   NaN  20.0  14.0
1   4.0   2.0  16.0   3.0
2   5.0  54.0   9.5   4.0
3   3.0   3.0   3.0   5.0
4   1.0   3.0   8.0   6.0